{
  "tvshows": [
    {
      "title": "Arrow (2012)",
      "poster": "https://image.tmdb.org/t/p/w300/gKG5QGz5Ngf8fgWpBsWtlg5L2SF.jpg",
      "genre": "Crime, Drama, Mystery, Action & Adventure",
      "running_time": "42m",
      "original_language": "English",
      "overview": "Spoiled billionaire playboy Oliver Queen is missing and presumed dead when his yacht is lost at sea. He returns five years later a changed man, determined to clean up the city as a hooded vigilante armed with a bow."
    },
    {
      "title": "Fairy Tail (2009)",
      "poster": "https://image.tmdb.org/t/p/w300/jsYTctFnK8ewomnUgcwhmsTkOum.jpg",
      "genre": "Action & Adventure, Animation, Comedy, Sci-Fi & Fantasy",
      "running_time": "25m",
      "original_language": "Japanese",
      "overview": "Lucy is a 17-year-old girl, who wants to be a full-fledged mage. One day when visiting Harujion Town, she meets Natsu, a young man who gets sick easily by any type of transportation. But Natsu isn't just any ordinary kid, he's a member of one of the world's most infamous mage guilds: Fairy Tail."
    },
    {
      "title": "The Flash (2014)",
      "poster": "https://image.tmdb.org/t/p/w300/4YaerJEQtWrAMPwjDZArSxhL3fC.jpg",
      "genre": "Drama, Sci-Fi & Fantasy",
      "running_time": "44m",
      "original_language": "English",
      "overview": "After a particle accelerator causes a freak storm, CSI Investigator Barry Allen is struck by lightning and falls into a coma. Months later he awakens with the power of super speed, granting him the ability to move through Central City like an unseen guardian angel. Though initially excited by his newfound powers, Barry is shocked to discover he is not the only \"meta-human\" who was created in the wake of the accelerator explosion -- and not everyone is using their new powers for good. Barry partners with S.T.A.R. Labs and dedicates his life to protect the innocent. For now, only a few close friends and associates know that Barry is literally the fastest man alive, but it won't be long before the world learns what Barry Allen has become...The Flash."
    },
    {
      "title": "Game of Thrones (2011)",
      "poster": "https://image.tmdb.org/t/p/w300/44rw2cOQrgUthZMhp3eibpXVy9p.jpg",
      "genre": "Sci-Fi & Fantasy, Drama, Action & Adventure, Mystery",
      "running_time": "1h",
      "original_language": "English",
      "overview": "Seven noble families fight for control of the mythical land of Westeros. Friction between the houses leads to full-scale war. All while a very ancient evil awakens in the farthest north. Amidst the war, a neglected military order of misfits, the Night's Watch, is all that stands between the realms of men and icy horrors beyond."
    },
    {
      "title": "Gotham (2014)",
      "poster": "https://image.tmdb.org/t/p/w300/4XddcRDtnNjYmLRMYpbrhFxsbuq.jpg",
      "genre": "Drama, Fantasy, Crime",
      "running_time": "43m",
      "original_language": "English",
      "overview": "Everyone knows the name Commissioner Gordon. He is one of the crime world's greatest foes, a man whose reputation is synonymous with law and order. But what is known of Gordon's story and his rise from rookie detective to Police Commissioner? What did it take to navigate the multiple layers of corruption that secretly ruled Gotham City, the spawning ground of the world's most iconic villains? And what circumstances created them – the larger-than-life personas who would become Catwoman, The Penguin, The Riddler, Two-Face and The Joker?"
    },
    {
      "title": "Grey's Anatomy (2005)",
      "poster": "https://image.tmdb.org/t/p/w300/mgOZSS2FFIGtfVeac1buBw3Cx5w.jpg",
      "genre": "Drama",
      "running_time": "43m",
      "original_language": "English",
      "overview": "Follows the personal and professional lives of a group of doctors at Seattle’s Grey Sloan Memorial Hospital."
    },
    {
      "title": "NCIS (2003)",
      "poster": "https://image.tmdb.org/t/p/w300/fi8EvaWtL5CvoielOjjVvTr7ux3.jpg",
      "genre": "Action & Adventure, Crime, Drama",
      "running_time": "45m",
      "original_language": "English",
      "overview": "From murder and espionage to terrorism and stolen submarines, a team of special agents investigates any crime that has a shred of evidence connected to Navy and Marine Corps personnel, regardless of rank or position."
    },
    {
      "title": "Riverdale (2017)",
      "poster": "https://image.tmdb.org/t/p/w300/6zBWSuYW3Ps1nTfeMS8siS4KUaA.jpg",
      "genre": "Drama, Mystery",
      "running_time": "45m",
      "original_language": "English",
      "overview": "Set in the present, the series offers a bold, subversive take on Archie, Betty, Veronica and their friends, exploring the surreality of small-town life, the darkness and weirdness bubbling beneath Riverdale’s wholesome facade."
    },
    {
      "title": "Shameless (2011)",
      "poster": "https://image.tmdb.org/t/p/w300/m2gf7SYOq9z30Q1dJFMF51DfrmF.jpg",
      "genre": "Drama, Comedy",
      "running_time": "1h",
      "original_language": "English",
      "overview": "Chicagoan Frank Gallagher is the proud single dad of six smart, industrious, independent kids, who without him would be... perhaps better off. When Frank's not at the bar spending what little money they have, he's passed out on the floor. But the kids have found ways to grow up in spite of him. They may not be like any family you know, but they make no apologies for being exactly who they are."
    },
    {
      "title": "Supergirl (2015)",
      "poster": "https://image.tmdb.org/t/p/w300/vqBsgL9nd2v04ZvCqPzwtckDdFD.jpg",
      "genre": "Action, Adventure, Drama, Science Fiction",
      "running_time": "42m",
      "original_language": "English",
      "overview": "Twenty-four-year-old Kara Zor-El, who was taken in by the Danvers family when she was 13 after being sent away from Krypton, must learn to embrace her powers after previously hiding them. The Danvers teach her to be careful with her powers, until she has to reveal them during an unexpected disaster, setting her on her journey of heroism."
    }
  ]
}